# GridEndSegmentPattern Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GridEndSegmentPattern Property
ParameterTypeId Class See Also
---
"End Segment Pattern"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GridEndSegmentPattern { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridEndSegmentPattern As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GridEndSegmentPattern {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace